src/main/resources/xml/trainingServer/getRentalById.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="my-namespace">
   <soapenv:Header/>
   <soapenv:Body>
      <my:getRentalByIdRequest>
         <my:rental_id></my:rental_id>
      </my:getRentalByIdRequest>
   </soapenv:Body>
</soapenv:Envelope>
